Revit 2024 API
StructuralSectionGeneralLZ.BottomFlangeLength Property
 Bottom Flange segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double BottomFlangeLength { get; set; }
Visual Basic
Public Property BottomFlangeLength As Double
	Get
	Set
Visual C++
public:
property double BottomFlangeLength {
	double get ();
	void set (double value);
}
See Also
StructuralSectionGeneralLZ Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace